results/cpu-vs-latency2/memcached/4-1/nsl203.out
[RUN #1] Preparing benchmark client...
[RUN #1] Launching threads now...
[RUN #1 100%,  30 secs]  0 threads:     1673349 ops,   56231 (avg:   55778) ops/sec, 2.12MB/sec (avg: 2.10MB/sec),  0.14 (avg:  0.14) msec latency

2         Threads
4         Connections per thread
30        Seconds
Type        Ops/sec     Hits/sec   Misses/sec      Latency       KB/sec
------------------------------------------------------------------------
Sets        5070.79          ---          ---      0.14300       375.89
Gets       50707.43     30816.22     19891.20      0.14000      1778.18
Totals     55778.22     30816.22     19891.20      0.14000      2154.08


Request Latency Distribution
Type     <= msec         Percent
------------------------------------------------------------------------
SET        -nan    100.00000
---
GET       0.048      0.00007
GET       0.049      0.00013
GET       0.050      0.00053
GET       0.051      0.00072
GET       0.052      0.00138
GET       0.053      0.00237
GET       0.054      0.00362
GET       0.055      0.00552
GET       0.056      0.00960
GET       0.057      0.01584
GET       0.058      0.02340
GET       0.059      0.03293
GET       0.060      0.04510
GET       0.061      0.06113
GET       0.062      0.07934
GET       0.063      0.10281
GET       0.064      0.13285
GET       0.065      0.16349
GET       0.066      0.20089
GET       0.067      0.24395
GET       0.068      0.29673
GET       0.069      0.36050
GET       0.070      0.43136
GET       0.071      0.51110
GET       0.072      0.60057
GET       0.073      0.69950
GET       0.074      0.80968
GET       0.075      0.93247
GET       0.076      1.06940
GET       0.077      1.22040
GET       0.078      1.38960
GET       0.079      1.57853
GET       0.080      1.79862
GET       0.081      2.03369
GET       0.082      2.30150
GET       0.083      2.60915
GET       0.084      2.98062
GET       0.085      3.41764
GET       0.086      3.92749
GET       0.087      4.52918
GET       0.088      5.19443
GET       0.089      5.96375
GET       0.090      6.82956
GET       0.091      7.81469
GET       0.092      8.94358
GET       0.093     10.28447
GET       0.094     12.04240
GET       0.095     14.33148
GET       0.096     16.49401
GET       0.097     18.30104
GET       0.098     19.89101
GET       0.099     21.40255
GET       0.100     28.33992
GET       0.110     38.48846
GET       0.120     45.37580
GET       0.130     52.50374
GET       0.140     65.38724
GET       0.150     76.88389
GET       0.160     81.56328
GET       0.170     84.10183
GET       0.180     86.35784
GET       0.190     88.91196
GET       0.200     90.70447
GET       0.210     91.71280
GET       0.220     92.47652
GET       0.230     93.28955
GET       0.240     94.30288
GET       0.250     95.15437
GET       0.260     95.75796
GET       0.270     96.26531
GET       0.280     96.77536
GET       0.290     97.35279
GET       0.300     97.79533
GET       0.310     98.10968
GET       0.320     98.36454
GET       0.330     98.59298
GET       0.340     98.80281
GET       0.350     98.96018
GET       0.360     99.08764
GET       0.370     99.19795
GET       0.380     99.29688
GET       0.390     99.38714
GET       0.400     99.46444
GET       0.410     99.52939
GET       0.420     99.59263
GET       0.430     99.64463
GET       0.440     99.69275
GET       0.450     99.73699
GET       0.460     99.77229
GET       0.470     99.79996
GET       0.480     99.82415
GET       0.490     99.84506
GET       0.500     99.86202
GET       0.510     99.87694
GET       0.520     99.89061
GET       0.530     99.90363
GET       0.540     99.91474
GET       0.550     99.92493
GET       0.560     99.93610
GET       0.570     99.94498
GET       0.580     99.95228
GET       0.590     99.95957
GET       0.600     99.96562
GET       0.610     99.97029
GET       0.620     99.97495
GET       0.630     99.97870
GET       0.640     99.98173
GET       0.650     99.98350
GET       0.660     99.98580
GET       0.670     99.98738
GET       0.680     99.98856
GET       0.690     99.98955
GET       0.700     99.99060
GET       0.710     99.99132
GET       0.720     99.99165
GET       0.730     99.99218
GET       0.740     99.99244
GET       0.750     99.99277
GET       0.760     99.99303
GET       0.770     99.99343
GET       0.780     99.99382
GET       0.790     99.99422
GET       0.800     99.99448
GET       0.810     99.99468
GET       0.820     99.99474
GET       0.830     99.99487
GET       0.840     99.99494
GET       0.850     99.99507
GET       0.860     99.99533
GET       0.870     99.99553
GET       0.880     99.99579
GET       0.890     99.99599
GET       0.900     99.99606
GET       0.910     99.99612
GET       0.920     99.99625
GET       0.930     99.99652
GET       0.940     99.99665
GET       0.950     99.99678
GET       0.960     99.99691
GET       0.970     99.99704
GET       0.980     99.99717
GET       0.990     99.99724
GET       1.000     99.99790
GET       1.100     99.99869
GET       1.200     99.99888
GET       1.300     99.99901
GET       1.500     99.99915
GET       1.600     99.99928
GET       1.800     99.99941
GET       1.900     99.99954
GET       2.300     99.99967
GET       2.700     99.99974
GET       2.800     99.99980
GET       3.800     99.99987
GET       4.000     99.99993
GET       4.200    100.00000